# Imports

In [2]:
import pandas as pd
import numpy as np
import boto3
import configparser
import psycopg2
from faker import Faker

## Conección

In [3]:
config = configparser.ConfigParser()
config.read('config.cfg')

['config.cfg']

In [5]:
try: 
    instance = aws_rds_conn.describe_db_instances(DBInstanceIdentifier=config.get('HECHOS','DB_INSTANCE_ID'))
    RDS_HOSTNAME = instance.get('DBInstances')[0].get('Endpoint').get('Address')
    print(RDS_HOSTNAME)
except Exception as ex:
    print('Error!!!',ex)

hechosdbproject.ctiwauocyj1r.us-east-2.rds.amazonaws.com

In [6]:
driver = f"""mysql://{config.get('HECHOS', 'DB_USERNAME')}:{config.get('HECHOS', 'DB_PASSWORD')}@{RDS_HOSTNAME}:{config.get('HECHOS', 'DB_PORT')}/{config.get('HECHOS', 'DB_NAME')}"""
driver

'mysql://adminpostgres:pUqUKYliiOJx958Y5m3KF9Sis@hechosdbproject.ctiwauocyj1r.us-east-2.rds.amazonaws.com:3306/hechos'

In [21]:
def insertData2SQL(df, table_name, driver):
    try:
        response = df.to_sql(table_name, driver, index=False, if_exists='append')
        print(f'Se han insertado {response} nuevos registros')
    except Exception as ex:
        print('Error!!!', ex)

In [10]:
postgres_driver = 'postgresql://ecomercedb:xi0iCRebLPEraW6f9C8U@ecomercedb.ctiwauocyj1r.us-east-2.rds.amazonaws.com:5432/ecomerce'
postgres_driver

'postgresql://ecomercedb:xi0iCRebLPEraW6f9C8U@ecomercedb.ctiwauocyj1r.us-east-2.rds.amazonaws.com:5432/ecomerce'

## Dimencion Articulo

In [11]:
sql_query = "select * from articulo"
df_articulo = pd.read_sql(sql_query, postgres_driver)
df_articulo.head()

,idarticulo,idcategoria,codigo,nombre,precio_venta,stock,descripcion,imagen,estado
0,1,1,FURN1,Elegant Office Desk,299.99,2280,A stylish and functional desk for your office.,,True
1,2,1,FURN2,Leather Sofa,799.99,1900,A comfortable leather sofa for your living room.,,True
2,3,1,FURN3,Wooden Dining Table,499.99,2128,A beautiful wooden dining table for your home.,,True
3,4,1,FURN4,Executive Chair,199.99,2432,An ergonomic chair for your office.,,True
4,5,1,FURN5,Bookshelf,149.99,1976,A sturdy bookshelf to organize your books.,,True

In [12]:
sql_query = "select * from categoria"
df_categoria = pd.read_sql(sql_query, postgres_driver)
df_categoria.head()

,idcategoria,nombre,descripcion,estado
0,1,Furniture,productos como muebles para oficina y casa,True
1,2,Toy,conjunto de productos para diversion,True
2,3,Health,productos utilizados para la salud,True
3,4,Car,productos para vehiculos,True
4,5,Electronics,productos electronicos de todo tipo,True

In [17]:
df_categoria_articulo = df_articulo.merge(df_categoria, on = 'idcategoria', how = 'inner')
df_categoria_articulo.head()

,idarticulo,idcategoria,codigo,nombre_x,precio_venta,stock,descripcion_x,imagen,estado_x,nombre_y,descripcion_y,estado_y
0,1,1,FURN1,Elegant Office Desk,299.99,2280,A stylish and functional desk for your office.,,True,Furniture,productos como muebles para oficina y casa,True
1,2,1,FURN2,Leather Sofa,799.99,1900,A comfortable leather sofa for your living room.,,True,Furniture,productos como muebles para oficina y casa,True
2,3,1,FURN3,Wooden Dining Table,499.99,2128,A beautiful wooden dining table for your home.,,True,Furniture,productos como muebles para oficina y casa,True
3,4,1,FURN4,Executive Chair,199.99,2432,An ergonomic chair for your office.,,True,Furniture,productos como muebles para oficina y casa,True
4,5,1,FURN5,Bookshelf,149.99,1976,A sturdy bookshelf to organize your books.,,True,Furniture,productos como muebles para oficina y casa,True

In [18]:
df_categoria_articulo.drop(['idcategoria', 'descripcion_x', 'descripcion_y', 'imagen', 'estado_y', 'estado_x'], axis=1, inplace=True)
df_categoria_articulo.head()

   idarticulo codigo             nombre_x  precio_venta  stock   nombre_y
0           1  FURN1  Elegant Office Desk        299.99   2280  Furniture
1           2  FURN2         Leather Sofa        799.99   1900  Furniture
2           3  FURN3  Wooden Dining Table        499.99   2128  Furniture
3           4  FURN4      Executive Chair        199.99   2432  Furniture
4           5  FURN5            Bookshelf        149.99   1976  Furniture

In [19]:
nombres_nuevos = {
    'nombre_x': 'nombre',
    'nombre_y': 'nombre_categoria'
}

df_categoria_articulo.rename(columns=nombres_nuevos, inplace=True)
df_categoria_articulo.head()

,idarticulo,codigo,nombre,precio_venta,stock,nombre_categoria
0,1,FURN1,Elegant Office Desk,299.99,2280,Furniture
1,2,FURN2,Leather Sofa,799.99,1900,Furniture
2,3,FURN3,Wooden Dining Table,499.99,2128,Furniture
3,4,FURN4,Executive Chair,199.99,2432,Furniture
4,5,FURN5,Bookshelf,149.99,1976,Furniture

In [22]:
insertData2SQL(df_categoria_articulo, 'dim_Articulo', driver)

Se han insertado None nuevos registros

## Dimension Persona

In [25]:
sql_query = "select * from persona"
df_persona = pd.read_sql(sql_query, postgres_driver)
df_persona.head()

,idpersona,tipo_persona,nombre,tipo_documento,num_documento,direccion,telefono,email
0,1,HOMBRE,Keith Sanchez,DNI,81698334937904490,"6586 Fields Rest Apt. 523\nLake Lukeberg, CT 9...",433-3761249,oowen@example.org
1,2,MUJER,Caitlin White,Pasaporte,68998464915473773,"4118 Lauren Place\nJohnsonview, MP 77537",508-6620328,elizabethmoran@example.org
2,3,HOMBRE,Taylor Ayala,Pasaporte,50587755093236224,"8999 Guzman Springs\nColemanborough, AS 85893",452-8843838,monicaholloway@example.net
3,4,HOMBRE,Thomas Hoover,Pasaporte,22135971649662819,"97981 Wolfe Station\nSolomonton, FM 89663",763-6251271,fgill@example.org
4,5,MUJER,Kristina Glass,DNI,83245230508524570,USS Smith\nFPO AE 53747,597-6062618,jenniferanderson@example.net

In [26]:
insertData2SQL(df_persona, 'dim_Persona', driver)

Se han insertado None nuevos registros

## Dimension Usuario

In [27]:
sql_query = "select * from usuario"
df_usuario = pd.read_sql(sql_query, postgres_driver)
df_usuario.head()

,idusuario,idrol,nombre,tipo_documento,num_documento,direccion,telefono,email,clave,estado
0,1,3,Ronald Durham,Pasaporte,21685653206775647,"35394 Brown Mall Apt. 352\nAmyburgh, IL 54664",00000000000000000000,davisshelly@example.net,"[b'\xc0', b'\xc7', b'\xfe', b'\x02', b'\x15', ...",False
1,2,1,Gregory Burch,Pasaporte,69210999840545495,"53023 Nicole Drive\nWest Jessica, DC 82681",00000000000000000000,oelliott@example.org,"[b'\xc3', b'\xe0', b'\x03', b'\xcb', b'r', b'\...",True
2,3,1,Eric Meadows,DPI,32647310368536862,USCGC Gonzalez\nFPO AE 11951,00000000000000000000,vsmith@example.com,"[b'\xdb', b'%', b'#', b'\xbe', b'j', b'\xed', ...",True
3,4,4,Scott Cox,DPI,65851574830601831,"42400 Ray Squares\nAaronfort, SD 46987",00000000000000000000,michaeljohnson@example.net,"[b'\x17', b'f', b'M', b'\xfe', b'7', b'\xf0', ...",True
4,5,3,Allison Koch,DPI,19599502954939346,"307 Eric Points\nWilliamsview, LA 18929",00000000000000000000,lanerobert@example.org,"[b'+', b'W', b'\xc7', b'F', b'\\', b'\xa7', b'...",False

In [30]:
sql_query = "select * from rol"
df_rol = pd.read_sql(sql_query, postgres_driver)
df_rol.head()

   idrol        nombre                                    descripcion  estado
0      1        Ventas  Departamento encargado de la comercialización    True
1      2  Contabilidad         Departamento encargado de las finanzas    True
2      3      Limpieza                Departamento encargado del aseo    True
3      4       Gerente                      Encargado de Departamento    True
4      5         Dueño                        Propietario del negocio    True

In [31]:
df_usuario_rol = df_usuario.merge(df_rol, on="idrol", how="inner")
df_usuario_rol.head()

,idusuario,idrol,nombre_x,tipo_documento,num_documento,direccion,telefono,email,clave,estado_x,nombre_y,descripcion,estado_y
0,1,3,Ronald Durham,Pasaporte,21685653206775647,"35394 Brown Mall Apt. 352\nAmyburgh, IL 54664",00000000000000000000,davisshelly@example.net,"[b'\xc0', b'\xc7', b'\xfe', b'\x02', b'\x15', ...",False,Limpieza,Departamento encargado del aseo,True
1,5,3,Allison Koch,DPI,19599502954939346,"307 Eric Points\nWilliamsview, LA 18929",00000000000000000000,lanerobert@example.org,"[b'+', b'W', b'\xc7', b'F', b'\\', b'\xa7', b'...",False,Limpieza,Departamento encargado del aseo,True
2,2,1,Gregory Burch,Pasaporte,69210999840545495,"53023 Nicole Drive\nWest Jessica, DC 82681",00000000000000000000,oelliott@example.org,"[b'\xc3', b'\xe0', b'\x03', b'\xcb', b'r', b'\...",True,Ventas,Departamento encargado de la comercialización,True
3,3,1,Eric Meadows,DPI,32647310368536862,USCGC Gonzalez\nFPO AE 11951,00000000000000000000,vsmith@example.com,"[b'\xdb', b'%', b'#', b'\xbe', b'j', b'\xed', ...",True,Ventas,Departamento encargado de la comercialización,True
4,6,1,Lauren Reese,Pasaporte,8016207275554064,USS Wright\nFPO AE 35647,00000000000000000000,olandry@example.com,"[b'\xcb', b'\x8f', b'\xf9', b'\xc5', b'\xfb', ...",True,Ventas,Departamento encargado de la comercialización,True

## Dimension Tiempo

In [35]:
df_tiempo = pd.read_csv('CSV/dim_date.csv')
df_tiempo.tail()

,date_key,full_date,day_of_week,day_num_in_month,day_num_overall,day_name,day_abbrev,weekday_flag,week_num_in_year,week_num_overall,...,month_name,month_abbrev,quarter,year,yearmo,fiscal_month,fiscal_quarter,fiscal_year,last_day_in_month_flag,same_day_year_ago_date
2186,20201226,12/26/2020,6,26,2187,Saturday,Sat,Weekend,52,317,...,December,Dec,4,2020,202012,6,2,2021,Not Month End,12/26/2019
2187,20201227,12/27/2020,7,27,2188,Sunday,Sun,Weekend,52,317,...,December,Dec,4,2020,202012,6,2,2021,Not Month End,12/27/2019
2188,20201228,12/28/2020,1,28,2189,Monday,Mon,Weekday,53,318,...,December,Dec,4,2020,202012,6,2,2021,Not Month End,12/28/2019
2189,20201229,12/29/2020,2,29,2190,Tuesday,Tue,Weekday,53,318,...,December,Dec,4,2020,202012,6,2,2021,Not Month End,12/29/2019
2190,20201230,12/30/2020,3,30,2191,Wednesday,Wed,Weekday,53,318,...,December,Dec,4,2020,202012,6,2,2021,Not Month End,12/30/2019

## Ventas